In [176]:
import pandas as pd

In [177]:
data = pd.read_csv("./assert/titanic.csv")
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [178]:
# 按照Age升序排序，dropna()过滤掉NaN
data.dropna().sort_values(["Age"])

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
305,306,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
183,184,1,2,"Becker, Master. Richard F",male,1.00,2,1,230136,39.0000,F4,S
205,206,0,3,"Strom, Miss. Telma Matilda",female,2.00,0,1,347054,10.4625,G6,S
297,298,0,1,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
340,341,1,2,"Navratil, Master. Edmond Roger",male,2.00,1,1,230080,26.0000,F2,S
...,...,...,...,...,...,...,...,...,...,...,...,...
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.00,0,1,113509,61.9792,B30,C
456,457,0,1,"Millet, Mr. Francis Davis",male,65.00,0,0,13509,26.5500,E38,S
745,746,0,1,"Crosby, Capt. Edward Gifford",male,70.00,1,1,WE/P 5735,71.0000,B22,S
96,97,0,1,"Goldschmidt, Mr. George B",male,71.00,0,0,PC 17754,34.6542,A5,C
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.00,0,0,27042,30.0000,A23,S

In [179]:
air = pd.read_csv("./assert/air_quality_long.csv",index_col="date.utc", parse_dates=True)
air

,city,country,location,parameter,value,unit
date.utc,,,,,,
2019-06-18 06:00:00+00:00,Antwerpen,BE,BETR801,pm25,18.0,µg/m³
2019-06-17 08:00:00+00:00,Antwerpen,BE,BETR801,pm25,6.5,µg/m³
2019-06-17 07:00:00+00:00,Antwerpen,BE,BETR801,pm25,18.5,µg/m³
2019-06-17 06:00:00+00:00,Antwerpen,BE,BETR801,pm25,16.0,µg/m³
2019-06-17 05:00:00+00:00,Antwerpen,BE,BETR801,pm25,7.5,µg/m³
...,...,...,...,...,...,...
2019-04-09 06:00:00+00:00,London,GB,London Westminster,no2,41.0,µg/m³
2019-04-09 05:00:00+00:00,London,GB,London Westminster,no2,41.0,µg/m³
2019-04-09 04:00:00+00:00,London,GB,London Westminster,no2,41.0,µg/m³
2019-04-09 03:00:00+00:00,London,GB,London Westminster,no2,67.0,µg/m³
2019-04-09 02:00:00+00:00,London,GB,London Westminster,no2,67.0,µg/m³

In [180]:
new_air = air[(air["parameter"] == "no2")].groupby("location").head(2)
new_air

,city,country,location,parameter,value,unit
date.utc,,,,,,
2019-06-21 00:00:00+00:00,Paris,FR,FR04014,no2,20.0,µg/m³
2019-06-20 23:00:00+00:00,Paris,FR,FR04014,no2,21.8,µg/m³
2019-06-17 08:00:00+00:00,Antwerpen,BE,BETR801,no2,41.0,µg/m³
2019-06-17 07:00:00+00:00,Antwerpen,BE,BETR801,no2,45.0,µg/m³
2019-06-17 11:00:00+00:00,London,GB,London Westminster,no2,11.0,µg/m³
2019-06-17 10:00:00+00:00,London,GB,London Westminster,no2,11.0,µg/m³

In [181]:
#对分组之后数据进行整形：columns-->使原先columns_value为 column_label values:为需要获取的值
new_air.pivot(columns="location",values="value")

# air.pivot(columns="location",values="value").plot()

location                   BETR801  FR04014  London Westminster
date.utc
2019-06-17 07:00:00+00:00     45.0      NaN                 NaN
2019-06-17 08:00:00+00:00     41.0      NaN                 NaN
2019-06-17 10:00:00+00:00      NaN      NaN                11.0
2019-06-17 11:00:00+00:00      NaN      NaN                11.0
2019-06-20 23:00:00+00:00      NaN     21.8                 NaN
2019-06-21 00:00:00+00:00      NaN     20.0                 NaN

In [182]:
# 数据透视表
# 展示各个地区采集的空气质量各参数的平均浓度
air.pivot_table(values="value",index="location",columns="parameter",aggfunc="mean",margins=True)

parameter                 no2       pm25        All
location
BETR801             26.950920  23.169492  24.982353
FR04014             29.374284        NaN  29.374284
London Westminster  29.740050  13.443568  21.491708
All                 29.430316  14.386849  24.222743

In [183]:
# 等价写法
new_g_air = air.groupby(["location","parameter"])["value"].mean()
new_g_air.to_frame().pivot_table(columns="parameter",values="value",index="location")

parameter                 no2       pm25
location
BETR801             26.950920  23.169492
FR04014             29.374284        NaN
London Westminster  29.740050  13.443568

In [198]:
air = pd.read_csv("./assert/air_quality_long.csv",index_col="date.utc", parse_dates=True)
air.pivot(columns="location", values="value").reset_index()

ValueError: Index contains duplicate entries, cannot reshape